package org.example;

/**
 * /**
 *  * Создайте шаблонный класс Array, который представляет собой массив, позволяющий хранить объекты
 *  * заданного типа. Необходимо реализовать:
 *  * ■ заполнение массива с клавиатуры;
 *  * ■ заполнение массива случайными числами;+
 *  * ■ отображение массива;+
 *  * ■ поиск максимального значения;+
 *  * ■ поиск минимального значения;+
 *  * ■ подсчет среднеарифметического значения;-
 *  * ■ сортировка массива по возрастанию;+
 *  * ■ сортировка массива по убыванию;+
 *  * ■ поиск значения в массиве, используя бинарный поиск;
 *  * ■ замена значения в массиве на новое значение.
 *  */

public class Main {
    public static void main(String[] args) {

    }
}